/*===== TAB LABELS */

/* Environement tab label */
Environment = "Ambiente";

/* About tab label */
About = "Info";


/*===== BUTTON LABELS */

/* Load Backup button label */
LoadBackup = "Carica Backup";

/* Save button label */
Save = "Registra";

/* Revert button label */
Revert = "Ripristina";

/* Cancel button label */
Cancel = "Annulla";

/* Continue lable */
Continue = "Continua";

/* Don't show again label */
DontShowAgain = "Non Mostrare Di Nuovo";


/*===== TABLE LABELS */

/* Variable column label */
Variable = "Variabile";

/* Value column label */
Value = "Valore";


/*===== DEFAULT VALUE TEXT */

/* Default key value */
DefaultKey = "CHIAVE";

/* Default value value */
DefaultValue = "Valore";


/*===== ERROR PANEL TITLES */

/* Value warning label */
ValueWarning = "Avviso Valore";

/* File error label */
FileError = "Errore File";

/* Backup error label */
BackupError = "Errore Backup";

/* Invalid Key label */
InvalidKey = "Chiave Non Valida";

/* Key Warning label */
KeyWarning = "Avviso Chiave";


/*===== ERROR STRINGS */

/* File does not exist format string, format string */
FileDoesNotExist = "~/%@/%@ non esiste, impossibile caricare.";

/* File error: Is not a file, format string */
FileIsNotFile = "~/%@/%@ è una directory, non un file.";

/* File error: Is not readable, format string */
FileIsNotReadable = "~/%@/%@ non è leggibile.";

/* File error: Can not write file */
FileNotWritable = "Impossibile scrivere su ~/%@/%@. Prego correggere e riprovare.";

/* Backup error unable to write file, format string */
BackupFileNotWritable = "Impossibile scrivere backup ~/%@/%@. Prego correggere e riprovare.";

/* Invalid Key, non-zero length */
ZeroLengthKey = "La chiave deve essere una stringa di lunghezza diversa da zero.";

/* Invalid key, already exists */
KeyExists = "La chiave esiste già.";

/* Key warning, PATH variables can be bad */
PathKeyWarning = "Fai attenzione, impostare la variabile d'ambiente PATH può condizionare drasticamente il modo in cui funzionano alcune applicazioni, specialmente gli strumenti per sviluppatori e l'ambiente di shell.";

/* Value warning, $ variables aren't expanded */
DollarValueWarning = "Fai attenzione al fatto che i valori di $<identifier> non vengono espansi quando viene letto il file di ambiente.";


/*===== MISC LABELS */

/* Warning about changes taking effect on next login */
NextLoginWarning = "Le modifiche avranno effetto al tuo prossimo login.";

/* Edit variable label */
EditVariable = "Modifica Variabile:";


/*===== TOOL TIPS */

/* Add item */
AddItemTip = "Aggiungi una variabile";

/* Remove item(s) */
RemoveItemTip = "Elimina variabili";

/* Edit variable value */
EditItemTip = "Modifica il valore della variabile";
